Tekla Open API Reference for Tekla Structures 2025
PourObject Properties
The PourObject type exposes the following members.
Properties
Name | Description
Class
 Gets or sets the class of the pour object.
ConcreteMixture
 Gets or sets the concrete mixture of the pour.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
PourNumber
 Gets or sets the pour number of the pour.
PourType
 Gets or sets the pour type of the pour.
Top
See Also
Reference
PourObject Class
Tekla.Structures.Model Namespace